tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "bat"
brew "diff-so-fancy"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "imagemagick"
brew "lazygit"
brew "mise"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tlrc"
brew "tmux"
brew "vim"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "alacritty"
cask "docker"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "intellij-idea-ce"
cask "keepingyouawake"
cask "microsoft-edge"
cask "rectangle"
cask "vlc"
cask "vscodium"
