tap "homebrew/bundle"
tap "homebrew/cask-fonts"

brew "asdf"
brew "bat"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "imagemagick"
brew "lazygit"
brew "ripgrep"
brew "shellcheck"
brew "starship"
brew "tmux"
brew "tree"
brew "vim"

cask "alacritty"
cask "firefox"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "google-chrome"
cask "keepingyouawake"
cask "microsoft-edge"
cask "rectangle"
cask "vlc"
cask "vscodium"
